Revit 2027 API
ParameterTypeId.RbsEnergyAnalysisProjectPhaseParam Property
 "Project Phase"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsEnergyAnalysisProjectPhaseParam { get; }
Public Shared ReadOnly Property RbsEnergyAnalysisProjectPhaseParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsEnergyAnalysisProjectPhaseParam {
	ForgeTypeId^ get ();
}
static member RbsEnergyAnalysisProjectPhaseParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace